app/views/events/index.html.erb

SELECT "events".* FROM "events"
---

    <% if current_user.events.length > 0 %>