app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    respond_to do | format |
      if @event.save
        if(params.require(:event).key?("tags"))
          tags = Tag.find(params.require(:event)['tags'])
---
INSERT INTO "events" ("name", "tag_id", "location", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jade's cool event"], ["tag_id", 1], ["location", "here"], ["description", "dadl;a;aw;aw"], ["created_at", "2020-02-26 23:22:19.330631"], ["updated_at", "2020-02-26 23:22:19.330631"]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]