app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-02-26 20:13:19.246467"], ["updated_at", "2020-02-26 20:13:19.246467"]]